benchmark/Prices-487k-PricesPerOffering-9.7k/bitmap/wrk2/bitmap-t2-c20-R2000.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/bitmap/prices
  2 threads and 20 connections
  Thread calibration: mean lat.: 1.138ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.140ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.16ms  506.74us   7.51ms   67.01%
    Req/Sec     1.05k   123.08     1.70k    78.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.10ms
 75.000%    1.49ms
 90.000%    1.86ms
 99.000%    2.30ms
 99.900%    3.44ms
 99.990%    7.20ms
 99.999%    7.51ms
100.000%    7.51ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.078     0.000000            1         1.00
       0.541     0.100000         3998         1.11
       0.708     0.200000         7981         1.25
       0.849     0.300000        11991         1.43
       0.973     0.400000        15982         1.67
       1.095     0.500000        19973         2.00
       1.162     0.550000        21964         2.22
       1.232     0.600000        23964         2.50
       1.308     0.650000        25932         2.86
       1.392     0.700000        27929         3.33
       1.489     0.750000        29930         4.00
       1.543     0.775000        30920         4.44
       1.597     0.800000        31928         5.00
       1.654     0.825000        32920         5.71
       1.717     0.850000        33923         6.67
       1.789     0.875000        34913         8.00
       1.824     0.887500        35422         8.89
       1.861     0.900000        35914        10.00
       1.899     0.912500        36407        11.43
       1.938     0.925000        36904        13.33
       1.982     0.937500        37412        16.00
       2.005     0.943750        37656        17.78
       2.029     0.950000        37907        20.00
       2.055     0.956250        38162        22.86
       2.083     0.962500        38408        26.67
       2.115     0.968750        38650        32.00
       2.135     0.971875        38781        35.56
       2.153     0.975000        38898        40.00
       2.175     0.978125        39031        45.71
       2.203     0.981250        39156        53.33
       2.229     0.984375        39277        64.00
       2.245     0.985938        39337        71.11
       2.265     0.987500        39401        80.00
       2.285     0.989062        39466        91.43
       2.305     0.990625        39521       106.67
       2.335     0.992188        39587       128.00
       2.349     0.992969        39615       142.22
       2.371     0.993750        39647       160.00
       2.397     0.994531        39677       182.86
       2.419     0.995313        39708       213.33
       2.459     0.996094        39741       256.00
       2.481     0.996484        39755       284.44
       2.511     0.996875        39771       320.00
       2.555     0.997266        39786       365.71
       2.623     0.997656        39802       426.67
       2.833     0.998047        39818       512.00
       2.895     0.998242        39825       568.89
       3.053     0.998437        39833       640.00
       3.181     0.998633        39842       731.43
       3.259     0.998828        39849       853.33
       3.529     0.999023        39857      1024.00
       3.601     0.999121        39860      1137.78
       3.803     0.999219        39864      1280.00
       4.107     0.999316        39868      1462.86
       5.063     0.999414        39872      1706.67
       5.279     0.999512        39876      2048.00
       5.355     0.999561        39878      2275.56
       5.671     0.999609        39880      2560.00
       5.919     0.999658        39882      2925.71
       6.123     0.999707        39884      3413.33
       6.599     0.999756        39886      4096.00
       6.703     0.999780        39887      4551.11
       7.107     0.999805        39888      5120.00
       7.127     0.999829        39889      5851.43
       7.139     0.999854        39890      6826.67
       7.195     0.999878        39891      8192.00
       7.195     0.999890        39891      9102.22
       7.271     0.999902        39892     10240.00
       7.271     0.999915        39892     11702.86
       7.287     0.999927        39893     13653.33
       7.287     0.999939        39893     16384.00
       7.287     0.999945        39893     18204.44
       7.367     0.999951        39894     20480.00
       7.367     0.999957        39894     23405.71
       7.367     0.999963        39894     27306.67
       7.367     0.999969        39894     32768.00
       7.367     0.999973        39894     36408.89
       7.511     0.999976        39895     40960.00
       7.511     1.000000        39895          inf
#[Mean    =        1.156, StdDeviation   =        0.507]
#[Max     =        7.508, Total count    =        39895]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59957 requests in 30.00s, 11.66MB read
Requests/sec:   1998.60
Transfer/sec:    398.16KB